/* ver.0.0.0 */
/*===============================================================================================================================*/
/* トークン取得                                                                                                                  */
/*                                                                                                                               */
/*                                                                                                                               */
/*===============================================================================================================================*/
/*===============================================================================================================================*/
/* 定数宣言                                                                                                                      */
/*                                                                                                                               */
/*===============================================================================================================================*/
/*******************************************************/
/* PlantUMLサーバのUR                                  */
/* [オンラインのPlantUML_WebServerを使う場合]          */
/*   http://www.plantuml.com/plantuml/png/をパスに指定 */
/* [ローカルのPlantUML Picoサーバを使う場合]           */
/*   (例)http://127.0.0.1:8080/ 等をパスに指定         */
/*******************************************************/
const PLANTUML_LOCAL_SERVER_URL   = "http://127.0.0.1:8080/plantuml/png/";
const PLANTUML_ONLINE_SERVER_URL  = "http://www.plantuml.com/plantuml/png/";

/*===============================================================================================================================*/
/* 変数宣言                                                                                                                      */
/*                                                                                                                               */
/*===============================================================================================================================*/

/*===============================================================================================================================*/
/* 関数宣言                                                                                                                      */
/*                                                                                                                               */
/*===============================================================================================================================*/
/*===============================================================================================================================*/
/**
 * 指定されたラジオボタンのURLテキストにPlantUMLサーバのURLを設定します。
 *
 * @param {string} radioLocalTextId - ローカルサーバ選択のラジオボタン:テキストボックスID
 * @param {string} radioOnlineId    - オンラインサーバ選択のラジオボタンID
 */
/*===============================================================================================================================*/
function setPlantUMLServer(radioLocalTextId, radioOnlineId) {
    const radioLocalText = document.getElementById(radioLocalTextId);
    const radioOnline    = document.getElementById(radioOnlineId);

    radioLocalText.value   = PLANTUML_LOCAL_SERVER_URL;
    radioOnline.innerHTML += "&nbsp &nbsp" + PLANTUML_ONLINE_SERVER_URL;
}

/*===============================================================================================================================*/
/**
 * 指定されたラジオボタンのチェック状態変化に併せてテキストボックスの入力有効/無効を切り替えます。
 *
 * @param {string} radioLocalId     - ローカルサーバ選択のラジオボタンID
 * @param {string} radioLocalTextId - ローカルサーバ選択のラジオボタン:テキストボックスID
 */
/*===============================================================================================================================*/
function changePlantUMLServer(radioLocalId, radioLocalTextId) {
    const radioLocal     = document.getElementById(radioLocalId);
    const radioLocalText = document.getElementById(radioLocalTextId);

    if ( radioLocal.checked ) {             // ラジオボタンがONのとき
        radioLocalText.disabled = false;    // ラジオボタンの横のテキスト入力欄を有効化
    }
    else { 
        radioLocalText.disabled = true;     // ラジオボタンの横のテキスト入力欄を無効化
    }
}

/*===============================================================================================================================*/
/**
 * 指定されたラジオボタンのサーバのURLを取得します。
 *
 * @param {string} radioLocalId     - ローカルサーバ選択のラジオボタンID
 * @param {string} radioLocalTextId - ローカルサーバ選択のラジオボタン:テキストボックスID
 * @returns {string}                PlantUMLサーバのURL
 */
/*===============================================================================================================================*/
function getPlantUMLServer(radioLocalId, radioLocalTextId) {
    let   serverPath      = "";
    const radioLocal      = document.getElementById(radioLocalId);
    const radioLocalText  = document.getElementById(radioLocalTextId);

    if ( radioLocal.checked ) {             // ラジオボタンがONのとき
        serverPath = radioLocalText.value;
    }
    else {
        serverPath = PLANTUML_ONLINE_SERVER_URL;
    }
    return serverPath;
}
/*===============================================================================================================================*/
/* 変更履歴                                                                                                                      */
/*===============================================================================================================================*/
/* バージョン : 日付       : 変更者   : 変更内容                                                                                 */
/* ----------------------------------------------------------------------------------------------------------------------------- */
/* 0.0.0      : 2025/01/24 : 北原英樹 : 新規作成                                                                                 */
/*                                                                                                                               */
/*                                                                                                                               */
/*===============================================================================================================================*/